DELETE
FROM task;
DELETE
FROM employee_role;
DELETE
FROM employee;
DELETE
FROM department;
DELETE
FROM company;

INSERT INTO company (name, physical_address, legal_address, head)
VALUES ('Сибирская геологическая компания', '660077, Красноярский край, г. Красноярск, ул. Весны, д. 5, оф. 122',
        '660077, Красноярский край, г. Красноярск, ул. Весны, д. 5, оф. 122', 'Стрельцов Александр Владимирович');

INSERT INTO department (name, contact, head, company_id)
VALUES ('Байкитская партия', '1-69', 'Атонов Сергей Борисович', 1),
       ('Восточно-Саянская партия', '1-55', 'Крылов Михаил Николаевич', 1),
       ('Приенисейская партия', '1-23', 'Лягушев Глеб Петрович', 1),
       ('Геохимическая партия', '1-43', 'Петрова Мария Сергеевна', 1),
       ('Отдел информационных технологий', '1-49', 'Строев Анатолий Глебович', 1),
       ('Геофизическая партия', '1-13', 'Иванов Александр Иванович', 1);

INSERT INTO employee (last_name, first_name, patronymic, position, company_id, department_id)
VALUES ('Спесивцев', 'Сергей', 'Андреевич', 'Геолог', 1, 1),
       ('Плеханов', 'Андрей', 'Дмитриевич', 'Ведущий геолог', 1, 1),
       ('Антонов', 'Сергей', 'Борисович', 'Начальник партии', 1, 1),
       ('Прохоров', 'Антон', 'Николаевич', 'Главный геолог партии', 1, 1),
       ('Прозорова', 'Юлия', 'Евгеньевна', 'Геолог 1 категории', 1, 1),
       ('Панова', 'Мария', 'Александровна', 'Геолог 2 категории', 1, 1),

       ('Евгеньев', 'Олег', 'Сергеевич', 'Геолог 2 категории', 1, 2),
       ('Крылов', 'Михаил', 'Николаевич', 'Начальник партии', 1, 2),
       ('Храмова', 'Алина', 'Сергеевна', 'Геолог 1 категории', 1, 2),
       ('Дмитриев', 'Алексей', 'Иванович', 'Ведущий геолог', 1, 2),
       ('Михайлова', 'Нина', 'Александровна', 'Техник-геолог', 1, 2),

       ('Семенова', 'Тамара', 'Юрьевна', 'Геолог 1 категории', 1, 3),
       ('Панов', 'Кирилл', 'Сергеевич', 'Геолог 2 категории', 1, 3),
       ('Лягушев', 'Глеб', 'Петрович', 'Начальник партии', 1, 3),
       ('Глухова', 'Анна', 'Петровна', 'Геолог', 1, 3),
       ('Никитин', 'Антон', 'Николаевич', 'Ведущий геолог', 1, 3),
       ('Панова', 'Мария', 'Александровна', 'Геолог', 1, 3),

       ('Егоров', 'Борис', 'Анатольевич', 'Геохимик 1 категории', 1, 4),
       ('Петрова', 'Мария', 'Сергеевна', 'Начальник партии', 1, 4),
       ('Егорова', 'Тамара', 'Васильевна', 'Ведущий геохимик', 1, 4),
       ('Катков', 'Владимир', 'Николаевич', 'Геохимик 2 категории', 1, 4),

       ('Строев', 'Анатолий', 'Глебович', 'Начальник отдела', 1, 5),
       ('Сержантов', 'Василий', 'Федорович', 'Специалист 1 категории', 1, 5),
       ('Внуков', 'Матвей', 'Александрович', 'Специалист по КБ', 1, 5),

       ('Иванов', 'Александр', 'Иванович', 'Начальник партии', 1, 6),
       ('Рыков', 'Иван', 'Матвеевич', 'Геофизик', 1, 6),
       ('Троянова', 'Евгения', 'Юрьевна', 'Техник-геофизик 1 категории', 1, 6),
       ('Воробьева', 'Яна', 'Максимовна', 'Геофизик 2 категории', 1, 6),
       ('Жуков', 'Даниил', 'Олегович', 'Главный геофизик партии', 1, 6);

INSERT INTO employee_role (employee_id, role)
VALUES (1, 'USER'),
       (2, 'USER'),
       (3, 'USER'),
       (3, 'MANAGER'),
       (4, 'USER'),
       (5, 'USER'),
       (6, 'USER'),

       (7, 'USER'),
       (8, 'USER'),
       (8, 'MANAGER'),
       (9, 'USER'),
       (10, 'USER'),
       (11, 'USER'),

       (12, 'USER'),
       (13, 'USER'),
       (14, 'USER'),
       (14, 'MANAGER'),
       (15, 'USER'),
       (16, 'USER'),
       (17, 'USER'),

       (18, 'USER'),
       (19, 'USER'),
       (19, 'MANAGER'),
       (20, 'USER'),
       (21, 'USER'),

       (22, 'ADMIN'),
       (22, 'USER'),
       (22, 'MANAGER'),
       (23, 'ADMIN'),
       (23, 'USER'),
       (24, 'ADMIN'),
       (24, 'USER'),

       (25, 'USER'),
       (25, 'MANAGER'),
       (26, 'USER'),
       (27, 'USER'),
       (28, 'USER'),
       (29, 'USER');

INSERT INTO task (title, author_id, performer_id, deadline, description)
VALUES ('Литохимия для квартального отчета по Узюпскому объекту', 3, 1,  (now() + INTERVAL '7 day'),
        'Необходимо подготовить разноску по участкам Троицкий и Успенский'),
       ('Глава "Бурение" в проект по Кизасскому объекту', 3, 1,  (now() + INTERVAL '14 day'),
        'Составить ГТН, написать текстовую часть'),
       ('Заявки на ТМЦ на полевой сезон', 3, 4,  (now() + INTERVAL '5 day'),
        'Сформировать заявки на покупку ТМЦ для Кизасского и Узюпского объектов, утвердить в отделе МТС'),

       ('Правки по геологической карте 25-го масштаба', 8, 9,  (now() + INTERVAL '2 day'),
        'Исправить: условные обозначения; линии разломов; привести к масштабу'),
       ('Внешний контроль литохимических проб', 8, 7,  (now() + INTERVAL '3 day'),
        'Отобрать и отправить на внешний контроль 350 проб по участку Семеновскому');
